railsapp/app/controllers/salads_controller.rb

SELECT "salads".* FROM "salads"
---
  def index
    @salads = Salad.all

SELECT  "salads".* FROM "salads" WHERE "salads"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @salad = Salad.find(params[:id])

INSERT INTO "salads" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Plain Salad"], ["text", "Lettuce and Tomato"], ["created_at", "2016-02-20 21:08:35.851005"], ["updated_at", "2016-02-20 21:08:35.851005"]]
---
  def create
    @salad = Salad.new(salad_params)

    if @salad.save